tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hdriver.c
/******************************************************************************
 Function Name   : usb_hstd_hcd_task
 Description     : USB Host Control Driver Task.
 Argument        : usb_vp_int_t stacd  : Task Start Code.
 Return          : none
 ******************************************************************************/
void usb_hstd_hcd_task (usb_vp_int_t stacd)
{
    usb_utr_t *p_mess;
    usb_utr_t *ptr;
    usb_er_t err;
    uint16_t rootport;
    uint16_t pipenum;
    uint16_t msginfo;
    uint16_t connect_inf;
    uint16_t retval;
    usb_hcdinfo_t* hp;

    /* Receive message */
    err = USB_TRCV_MSG(USB_HCD_MBX, (usb_msg_t** )&p_mess, (usb_tm_t )10000);
    if (USB_OK != err)
    {
        return;
    }
    else
    {
        ptr = (usb_utr_t *) p_mess;
        hp = (usb_hcdinfo_t*) p_mess;
        rootport = ptr->keyword;
        pipenum = ptr->keyword;

        /* Branch Hcd Task receive Message Command */
        msginfo = ptr->msginfo;
        switch (msginfo)
        {
            case USB_MSG_HCD_INT :

                /* USB INT */
                usb_hstd_interrupt(ptr);
            break;

            case USB_MSG_HCD_PCUTINT :
                ptr = (usb_utr_t*) p_usb_shstd_hcd_msg;

                /* USB interrupt Handler */
                usb_hstd_interrupt_handler(ptr);

                /* USB INT */
                usb_hstd_interrupt(ptr);
                ptr->msginfo = USB_MSG_HCD_INT;
            break;

            case USB_MSG_HCD_SUBMITUTR :

                /* USB Submit utr */
                usb_hstd_set_submitutr(ptr);
            break;

            case USB_MSG_HCD_ATTACH :

                /* USB attach / detach */
                usb_hstd_attach_process(ptr, rootport);

                if (USB_NULL == hp->complete)   /* Chack Callback function */
                {
                    while(1)
                    {
                        /* Error Stop */
                    }
                }
                /* Callback */
                (hp->complete)(ptr, rootport, USB_MSG_HCD_ATTACH);

                /* Release Memory Block */
                usb_hstd_hcd_rel_mpl(ptr, msginfo);
            break;

            case USB_MSG_HCD_ATTACH_MGR :

                /* USB attach / detach */
                usb_hstd_attach_process(ptr, rootport);
                connect_inf = usb_cstd_port_speed(ptr, rootport);

                if (USB_NULL == hp->complete)   /* Chack Callback function */
                {
                    while(1)
                    {
                        /* Error Stop */
                    }
                }
                /* Callback */
                (hp->complete)(ptr, rootport, connect_inf);

                /* Release Memory Block */
                usb_hstd_hcd_rel_mpl(ptr, msginfo);
            break;

            case USB_MSG_HCD_DETACH :

                /* USB detach process */
                usb_hstd_detach_process(ptr, rootport);

                if (USB_NULL == hp->complete)   /* Chack Callback function */
                {
                    while(1)
                    {
                        /* Error Stop */
                    }
                }
                /* Callback */
                (hp->complete)(ptr, rootport, USB_MSG_HCD_DETACH);

                /* Release Memory Block */
                usb_hstd_hcd_rel_mpl(ptr, msginfo);
            break;

            case USB_MSG_HCD_DETACH_MGR :
                hw_usb_clear_dvstctr(ptr, USB_PORT0, (USB_RWUPE | USB_USBRST | USB_RESUME | USB_UACT));

                usb_cpu_delay_xms(1);

                /* interrupt disable */
                usb_hstd_attch_disable(ptr, rootport);
                usb_hstd_dtch_disable(ptr, rootport);
                usb_hstd_bchg_disable(ptr, rootport);
                if (USB_NULL == hp->complete)   /* Chack Callback function */
                {
                    while(1)
                    {
                        /* Error Stop */
                    }
                }
                (hp->complete)(ptr, rootport, USB_MSG_HCD_DETACH_MGR);
                usb_hstd_hcd_rel_mpl(ptr, msginfo);
            break;

            case USB_MSG_HCD_USBRESET :

                /* USB bus reset */
                usb_hstd_bus_reset(ptr, rootport);

                /* Check current port speed */
                connect_inf = usb_cstd_port_speed(ptr, rootport);

                if (USB_NULL == hp->complete)   /* Chack Callback function */
                {
                    while(1)
                    {
                        /* Error Stop */
                    }
                }
                /* Callback */
                (hp->complete)(ptr, rootport, connect_inf);

                /* Release Memory Block */
                usb_hstd_hcd_rel_mpl(ptr, msginfo);
            break;

            case USB_MSG_HCD_REMOTE :

                /* Suspend device */
                g_usb_hstd_remort_port[rootport] = USB_SUSPENDED;
                usb_hstd_suspend(ptr, rootport);

                if (USB_NULL == hp->complete)   /* Chack Callback function */
                {
                    while(1)
                    {
                        /* Error Stop */
                    }
                }
                /* CallBack */
                (hp->complete)(ptr, rootport, USB_MSG_HCD_REMOTE);

                /* Release Memory Block */
                usb_hstd_hcd_rel_mpl(ptr, msginfo);
            break;

            case USB_MSG_HCD_SUSPEND :
                usb_hstd_suspend(ptr, rootport); /* Suspend device */
                if (USB_NULL == hp->complete)   /* Chack Callback function */
                {
                    while(1)
                    {
                        /* Error Stop */
                    }
                }
                (hp->complete)(ptr, rootport, USB_MSG_HCD_SUSPEND);
                usb_hstd_hcd_rel_mpl(ptr, msginfo); /* Release Memory Block */
            break;

            case USB_MSG_HCD_RESUME :
                usb_hstd_resume_process(ptr, rootport); /* USB resume */
                if (USB_NULL == hp->complete)   /* Chack Callback function */
                {
                    while(1)
                    {
                        /* Error Stop */
                    }
                }
                (hp->complete)(ptr, rootport, USB_MSG_HCD_RESUME); /* Callback */
                usb_hstd_hcd_rel_mpl(ptr, msginfo); /* Release Memory Block */
            break;

