tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hdriver.c
    return err;
}
/******************************************************************************
 End of function usb_hstd_mgr_open
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_driver_registration
 Description     : The HDCD information registered in the class driver structure
                 : is registered in HCD.
 Arguments       : usb_utr_t *ptr           : Pointer to usb_utr_t structure.
                 : usb_hcdreg_t *callback   : Pointer to usb_hcdreg_t structure
 Return          : none
 ******************************************************************************/
void usb_hstd_driver_registration (usb_utr_t *ptr, usb_hcdreg_t *callback)
{
    usb_hcdreg_t *driver;

    if (g_usb_hstd_device_num[ptr->ip] <= USB_MAXDEVADDR)
    {
        driver = &g_usb_hstd_device_drv[ptr->ip][g_usb_hstd_device_num[ptr->ip]];

        driver->rootport = USB_NOPORT; /* Root port */
        driver->devaddr = USB_NODEVICE; /* Device address */
        driver->devstate = USB_DETACHED; /* Device state */
        driver->ifclass = callback->ifclass; /* Interface Class */
        driver->p_tpl = callback->p_tpl; /* Target peripheral list */
        driver->p_pipetbl = callback->p_pipetbl; /* Pipe Define Table address */
        driver->classinit = callback->classinit; /* Driver init */
        driver->classcheck = callback->classcheck; /* Driver check */
        driver->devconfig = callback->devconfig; /* Device configured */
        driver->devdetach = callback->devdetach; /* Device detach */
        driver->devsuspend = callback->devsuspend; /* Device suspend */
        driver->devresume = callback->devresume; /* Device resume */

        if (USB_NULL == driver->classinit)   /* Chack Callback function */
        {
            while(1)
            {
                /* Error Stop */
            }
        }
        /* Initialized device driver */
        (*driver->classinit)(ptr, driver->devaddr, (uint16_t) USB_NO_ARG);

        g_usb_hstd_device_num[ptr->ip]++;
        USB_PRINTF1("*** Registration driver 0x%02x\n",driver->ifclass);
    }
    else
    {
        USB_PRINTF0("### Registration device driver over\n");
    }
}
/******************************************************************************
 End of function usb_hstd_driver_registration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_driver_release
 Description     : Release the Device Class Driver.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint8_t   devclass   : Interface class
 Return          : none
 ******************************************************************************/
void usb_hstd_driver_release (usb_utr_t *ptr, uint8_t devclass)
{
    usb_hcdreg_t *driver;
    uint16_t i;
    uint16_t flg;

    if (USB_IFCLS_NOT == devclass)
    {
        /* Device driver number */
        g_usb_hstd_device_num[ptr->ip] = 0;
    }
    else
    {
        for (flg = 0u, i = 0u
        ; (i < (USB_MAXDEVADDR + 1u)) && (0u == flg); i++)
        {
            driver = &g_usb_hstd_device_drv[ptr->ip][i];
            if (driver->ifclass == devclass)
            {

                driver->rootport = USB_NOPORT; /* Root port */
                driver->devaddr = USB_NODEVICE; /* Device address */
                driver->devstate = USB_DETACHED; /* Device state */

                /* Interface Class : NO class */
                driver->ifclass = (uint16_t) USB_IFCLS_NOT;

                g_usb_hstd_device_num[ptr->ip]--;
                USB_PRINTF1("*** Release class %d driver ***\n",devclass);
                flg = 1u; /* break; */
            }
        }
    }
}
/******************************************************************************
 End of function usb_hstd_driver_release
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hstd_chk_pipe_info
 Description     : Analyze descriptor information of the connected USB Device,
                   and reflect it in the pipe information table.
 Argument        : uint16_t speed            : USB Device speed
                 : uint16_t *ep_tbl          : DEF_EP table pointer
                 : uint8_t  *descriptor      : Endpoint Descriptor table
 Return          : uint16_t                  : DIR_H_IN / DIR_H_OUT / USB_ERROR
 ******************************************************************************/
uint16_t usb_hstd_chk_pipe_info (uint16_t speed, uint16_t *ep_tbl, uint8_t *descriptor)
{
    uint16_t pipe_cfg;
    uint16_t pipe_maxp;
    uint16_t pipe_peri;
    uint16_t retval;
    uint16_t work1;
    uint16_t work2;

    /* Check Endpoint descriptor */
    /* Descriptor Type */
    if (USB_DT_ENDPOINT == descriptor[1])
    {
        switch ((uint16_t) (descriptor[3] & USB_EP_TRNSMASK))
        {
            /* Control Endpoint */
            case USB_EP_CNTRL :
                USB_PRINTF0("###Control pipe is not support.\n");
                return USB_ERROR;
            break;

                /* Isochronous Endpoint */
            case USB_EP_ISO :
                if ((USB_PIPE1 != ep_tbl[0]) && (USB_PIPE2 != ep_tbl[0]))
                {
                    USB_PRINTF0("###Iso pipe is 1 or 2.\n");
                    return USB_ERROR;
                }
                USB_PRINTF0(" ISOCH ");
                pipe_cfg = USB_TYPFIELD_ISO;
            break;

                /* Bulk Endpoint */
            case USB_EP_BULK :
                if ((ep_tbl[0] < USB_PIPE1) || (ep_tbl[0] > USB_PIPE5))
                {
                    USB_PRINTF0("###Bulk pipe is 1 to 5.\n");
                    return USB_ERROR;
                }
                pipe_cfg = USB_TYPFIELD_BULK; /* USB_PRINTF0(" BULK "); */
            break;

                /* Interrupt Endpoint */
            case USB_EP_INT :
                if ((ep_tbl[0] < USB_PIPE6) || (ep_tbl[0] > USB_MAX_PIPE_NO))
                {
                    USB_PRINTF0("###Int pipe is 6 to 9.\n");
                    return USB_ERROR;
                }
                pipe_cfg = USB_TYPFIELD_INT; /* USB_PRINTF0(" INT "); */
            break;
            default :
                USB_PRINTF0("###Endpoint Descriptor error.\n");
                return USB_ERROR;
            break;
        }

