tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hdriver.c
        /* Set pipe configuration table */
        if ((descriptor[2] & USB_EP_DIRMASK) == USB_EP_IN)
        {
            /* IN(receive) */

            if ((descriptor[3] & USB_EP_TRNSMASK) != USB_EP_ISO)
            {
                /* Compulsory SHTNAK */
                pipe_cfg |= (USB_CFG_SHTNAKON | USB_DIR_H_IN);
            }
            else
            {
                pipe_cfg |= USB_DIR_H_IN;
            }
            pipe_cfg |= (uint16_t) (ep_tbl[1] & (USB_DBLBFIELD | USB_CNTMDFIELD));
            retval = USB_DIR_H_IN;
        }
        else
        {
            /* OUT(send) */
            pipe_cfg |= (uint16_t) ((uint16_t) (ep_tbl[1] & (USB_DBLBFIELD | USB_CNTMDFIELD)) | USB_DIR_H_OUT);
            retval = USB_DIR_H_OUT;
        }

        /* Endpoint number set */
        pipe_cfg |= (uint16_t) (descriptor[2] & USB_EP_NUMMASK);

        /* Max packet size set */
        pipe_maxp = (uint16_t) (descriptor[4] | (uint16_t) ((uint16_t) descriptor[5] << 8u));

        /* Buffer flash */
        pipe_peri = (uint16_t) (ep_tbl[4] & (~USB_IITVFIELD));
        if (0 != descriptor[6])
        {
            /* FS/LS interrupt */
            if (((uint16_t) (pipe_cfg & USB_TYPFIELD) == USB_TYPFIELD_INT) && (USB_HSCONNECT != speed))
            {
                work1 = descriptor[6];
                work2 = 0;
                for (; 0 != work1; work2++)
                {
                    work1 = (uint16_t) (work1 >> 1);
                }
                if (0 != work2)
                {
                    /* Interval time */
                    pipe_peri |= (uint16_t) (work2 - 1);
                }
            }
            else
            {
                if (descriptor[6] <= 8)
                {
                    /* Interval time */
                    pipe_peri |= (uint16_t) ((descriptor[6] - 1u) & (USB_IITVFIELD));
                }
                else
                {
                    /* Interval time */
                    pipe_peri |= ((uint16_t) (0x00FFu) & (USB_IITVFIELD));
                }
            }
        }
        ep_tbl[1] = pipe_cfg;
        ep_tbl[3] = pipe_maxp;
        ep_tbl[4] = pipe_peri;

        /* USB_PRINTF4(" pipe%d configuration %04X %04X %04X\n", ep_tbl[0], ep_tbl[1], ep_tbl[3], ep_tbl[4]); */
    }
    else
    {
        USB_PRINTF0("###Endpoint Descriptor error.\n");
        return USB_ERROR;
    }
    return (retval);
}
/******************************************************************************
 End of function usb_hstd_chk_pipe_info
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_set_pipe_info
 Description     : Copy information of pipe information table from source
                 :  (2nd argument) to destination (1st argument)
 Argument        : uint16_t *dst_ep_tbl      : DEF_EP table pointer(destination)
                 : uint16_t *src_ep_tbl      : DEF_EP table pointer(source)
                 : uint16_t length           : Table length
 Return          : none
 ******************************************************************************/
void usb_hstd_set_pipe_info (uint16_t *dst_ep_tbl, uint16_t *src_ep_tbl, uint16_t length)
{
    uint16_t i;

    /*USB_PRINTF3("!!! %lx %lx %d\n", dst_ep_tbl, src_ep_tbl, length);*/

    for (i = 0; i < length; i++)
    {
        dst_ep_tbl[i] = src_ep_tbl[i];
    }
}
/******************************************************************************
 End of function usb_hstd_set_pipe_info
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_return_enu_mgr
 Description     : Continuous enumeration is requested to MGR task (API for nonOS)
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t cls_result  : class check result
 Return          : none
 ******************************************************************************/
void usb_hstd_return_enu_mgr (usb_utr_t *ptr, uint16_t cls_result)
{
    g_usb_hstd_check_enu_result[ptr->ip] = cls_result;
    usb_hstd_mgr_snd_mbx(ptr, USB_MSG_MGR_SUBMITRESULT, USB_PIPE0, USB_CTRL_END);
}
/******************************************************************************
 End of function usb_hstd_return_enu_mgr
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_enu_wait
 Description     : Request to change enumeration priority(API for nonOS)
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t taskID      : Enumeration wait Task ID
 Return          : none
 ******************************************************************************/
void usb_hstd_enu_wait (usb_utr_t *ptr, uint8_t task_id)
{
    g_usb_hstd_enu_wait[ptr->ip] = task_id;

}
/******************************************************************************
 End of function usb_hstd_enu_wait
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_change_device_state
 Description     : Request to change the status of the connected USB Device
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : usb_cb_t complete    : callback function pointer
                 : uint16_t msginfo     : Message Info
                 : uint16_t member      : Device address/pipe number
 Return          : usb_err_t            : USB_OK etc
 ******************************************************************************/
usb_er_t usb_hstd_change_device_state (usb_utr_t *ptr, usb_cb_t complete, uint16_t msginfo, uint16_t member)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_er_t err2;
    usb_hcdinfo_t *hp;

    switch (msginfo)
    {
        /* USB_MSG_HCD_CLR_STALL */
        case USB_DO_CLR_STALL :
            err = usb_hstd_hcd_snd_mbx(ptr, USB_MSG_HCD_CLR_STALL, member, (uint16_t*) 0, complete);
        break;

            /* USB_MSG_HCD_SQTGLBIT */
        case USB_DO_SET_SQTGL :
            err = usb_hstd_hcd_snd_mbx(ptr, USB_MSG_HCD_SETSEQBIT, member, (uint16_t*) 0, complete);
        break;

            /* USB_MSG_HCD_CLRSEQBIT */
        case USB_DO_CLR_SQTGL :
            err = usb_hstd_hcd_snd_mbx(ptr, USB_MSG_HCD_CLRSEQBIT, member, (uint16_t*) 0, complete);
        break;

        default :

